xml/verifyCustomerChallenge.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope" xmlns:e="http://www.technisys.net/cmm/services/errors/v1.0" xmlns:md="http://www.technisys.net/cmm/services/metadata/v2.0" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
  <SOAP-ENV:Header>
    <md:metadata>
      <serviceId>verifyCustomerChallenge</serviceId>
      <serviceVersion>0.0</serviceVersion>
      <sessionId>${sessionId}</sessionId>
      <targetChannel>
        <mnemonic>${channel}</mnemonic>
      </targetChannel>
      <executingChannel>
        <mnemonic>${channel}</mnemonic>
      </executingChannel>
      <address>ip=${ip};</address>
      <featureId>ROL@2001</featureId>
      <locale>en_PA</locale>
      <cmmDispatchDate>${cmmDispatchDate}</cmmDispatchDate>
      <customProperties/>
    </md:metadata>
  </SOAP-ENV:Header>
  <SOAP-ENV:Body>
    <srv:verifyCustomerChallengeRequest xmlns:srv="http://www.technisys.net/cmm/services/verifyCustomerChallenge/rq/v0.0">
      <collection name="challenges">
        <challenge>
          <challengeAnswer>${challengeAnswer}</challengeAnswer>
        </challenge>
      </collection>
      <electronicsContact name="electronicsContact">
        <emailAddressComplete>${emailAddressComplete}</emailAddressComplete>
        <subject>Segundo factor inválido</subject>
      </electronicsContact>
      <authentication name="authentication">
        <dynamicAuthenticacion>
          <authenticationType>
            <authenticatesProfiling>false</authenticatesProfiling>
          </authenticationType>
        </dynamicAuthenticacion>
        <authenticationId>${authenticationId}</authenticationId>
      </authentication>
      <token name="preAdhesionToken">
        <value>${token}</value>
      </token>
      <customer name="customer">
        <customerId>uriSFB=ECU#C#${identificacion}</customerId>
      </customer>
      <authorizationMethod name="authorizationMethod">
        <mnemonic>OTP</mnemonic>
        <mnemonic>OTP</mnemonic>
      </authorizationMethod>
      <generic>
        <validatedCustomer type="java.lang.Boolean">true</validatedCustomer>
      </generic>
    </srv:verifyCustomerChallengeRequest>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>